cfg/Reports/ОрганизационнаяДиаграммаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОрганизационнаяДиаграммаОрганизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

cfg/Reports/ОрганизационнаяДиаграммаОрганизации/Forms/ФормаГлавная/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "Перед открытием" формы отчета.
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	// Установим дату начала отчета
	Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ДатаАктуальности = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяДатаНачалаОтчетов");
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = РабочаяДата
	КонецЕсли;
	
	ВидОтчета = "СтруктураПодразделений";

КонецПроцедуры // ПередОткрытием()

// Процедура - обработчик события "При открытии" формы отчета.
//
Процедура ПриОткрытии()

	Если НЕ ВладелецФормы = Неопределено Тогда
		
		ЕстьОшибки = Ложь;
		СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЕстьОшибки);
		Если ЕстьОшибки Тогда
			Сообщить("Ошибки...");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПриОткрытии()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНДНЫХ ПАНЕЛЕЙ

// Процедура - обработчик нажатия кнопки "Сформировать"
//
Процедура КнопкаСформироватьНажатие(Элемент)

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		Предупреждение(НСтр("ru='Не выбрана организация!';uk='Не обрана організація!'"));
		Возврат;
	КонецЕсли;	
		
	СформироватьОтчет(ЭлементыФормы.ДокументРезультат, ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка);

КонецПроцедуры // КнопкаСформироватьНажатие()

Процедура ДействияФормыНастройка(Кнопка)
	
	ФормаНастройка = ПолучитьФорму("ФормаНастройки", ЭтаФорма);

	РезультатОткрытия = ФормаНастройка.ОткрытьМодально();

	СформироватьОтчет(Элементыформы.ДокументРезультат, ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка)

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ДИАЛОГА

Процедура ВидОтчетаПриИзменении(Элемент)
	
	СформироватьСписокПоказателей();
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		КнопкаСформироватьНажатие(Элемент);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействияФормыЗаголовок(Кнопка)
	
	ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка = НЕ ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка;
	КнопкаСформироватьНажатие(Кнопка);
	
КонецПроцедуры
